socialNetwork/runs/e2e-compose-post-2-rBRw/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/post/compose
  4 threads and 64 connections

  Thread calibration: mean lat.: 16.463ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 16.743ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 16.545ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 16.641ms, rate sampling interval: 50ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    18.38ms    8.21ms  47.55ms   79.85%
    Req/Sec   252.77     78.16   440.00     67.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.29ms
 75.000%   21.53ms
 90.000%   28.61ms
 99.000%   47.55ms
 99.900%   70.27ms
 99.990%   87.04ms
 99.999%   88.19ms
100.000%   88.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.727     0.000000            1         1.00
      10.775     0.100000         2008         1.11
      12.351     0.200000         4018         1.25
      13.591     0.300000         6007         1.43
      14.903     0.400000         8010         1.67
      16.287     0.500000        10009         2.00
      17.151     0.550000        11025         2.22
      18.031     0.600000        12011         2.50
      19.023     0.650000        13019         2.86
      20.191     0.700000        14021         3.33
      21.535     0.750000        15017         4.00
      22.399     0.775000        15514         4.44
      23.279     0.800000        16018         5.00
      24.367     0.825000        16516         5.71
      25.503     0.850000        17014         6.67
      26.831     0.875000        17518         8.00
      27.631     0.887500        17763         8.89
      28.607     0.900000        18014        10.00
      29.727     0.912500        18263        11.43
      30.959     0.925000        18513        13.33
      32.319     0.937500        18766        16.00
      33.119     0.943750        18892        17.78
      33.983     0.950000        19014        20.00
      35.199     0.956250        19141        22.86
      36.447     0.962500        19264        26.67
      37.951     0.968750        19389        32.00
      38.911     0.971875        19452        35.56
      39.839     0.975000        19513        40.00
      40.799     0.978125        19577        45.71
      41.887     0.981250        19640        53.33
      43.583     0.984375        19701        64.00
      44.511     0.985938        19732        71.11
      45.503     0.987500        19764        80.00
      46.815     0.989062        19795        91.43
      48.191     0.990625        19826       106.67
      49.919     0.992188        19858       128.00
      50.847     0.992969        19874       142.22
      51.999     0.993750        19889       160.00
      53.727     0.994531        19905       182.86
      55.071     0.995313        19920       213.33
      57.375     0.996094        19935       256.00
      58.975     0.996484        19943       284.44
      60.703     0.996875        19952       320.00
      62.079     0.997266        19959       365.71
      63.839     0.997656        19967       426.67
      64.895     0.998047        19974       512.00
      65.279     0.998242        19978       568.89
      66.175     0.998437        19982       640.00
      68.095     0.998633        19986       731.43
      68.991     0.998828        19990       853.33
      71.231     0.999023        19994      1024.00
      72.895     0.999121        19996      1137.78
      73.727     0.999219        19998      1280.00
      74.751     0.999316        20000      1462.86
      75.519     0.999414        20002      1706.67
      77.055     0.999512        20004      2048.00
      79.551     0.999561        20005      2275.56
      80.255     0.999609        20006      2560.00
      81.215     0.999658        20007      2925.71
      81.791     0.999707        20008      3413.33
      82.431     0.999756        20009      4096.00
      82.431     0.999780        20009      4551.11
      86.207     0.999805        20010      5120.00
      86.207     0.999829        20010      5851.43
      87.039     0.999854        20011      6826.67
      87.039     0.999878        20011      8192.00
      87.039     0.999890        20011      9102.22
      87.743     0.999902        20012     10240.00
      87.743     0.999915        20012     11702.86
      87.743     0.999927        20012     13653.33
      87.743     0.999939        20012     16384.00
      87.743     0.999945        20012     18204.44
      88.191     0.999951        20013     20480.00
      88.191     1.000000        20013          inf
#[Mean    =       18.383, StdDeviation   =        8.212]
#[Max     =       88.128, Total count    =        20013]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29926 requests in 30.00s, 6.14MB read
  Non-2xx or 3xx responses: 34
Requests/sec:    997.61  
Transfer/sec:    209.50KB